/**********************************************************
* @ File name -> delay.h
* @ Version   -> V1.0
* @ Date      -> 12-26-2013
* @ Brief     -> 系统延时相关的函数头文件

* @ 详细说明请参考《Cortex-M3权威指南(中文)》第133页 第8章 SysTick定时器介绍
**********************************************************/

#ifndef _delay_h_
#define _delay_h_

/**********************************************************
                     外部函数头文件                        
**********************************************************/

#include "sys.h"

/**********************************************************
                     外部功能函数
**********************************************************/

void delay_init(uint8_t SYSCLK);	//初始化延时函数
void delay_us(uint32_t nus);	//延时n个us
void delay_ms(uint16_t nms);	//延时n个ms


#endif

